In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('car_prices.csv')
df.head(n=13)

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [3]:
# df1=df.copy()
# df1[['BMW','Audi','Merc']]=pd.get_dummies(df['Car Model'])
dummy_df=pd.get_dummies(df['Car Model'])
dummy_df=pd.concat([df,dummy_df],axis=1)
dummy_df

,Car Model,Mileage,Sell Price($),Age(yrs),Audi A5,BMW X5,Mercedez Benz C class
0,BMW X5,69000,18000,6,0,1,0
1,BMW X5,35000,34000,3,0,1,0
2,BMW X5,57000,26100,5,0,1,0
3,BMW X5,22500,40000,2,0,1,0
4,BMW X5,46000,31500,4,0,1,0
5,Audi A5,59000,29400,5,1,0,0
6,Audi A5,52000,32000,5,1,0,0
7,Audi A5,72000,19300,6,1,0,0
8,Audi A5,91000,12000,8,1,0,0
9,Mercedez Benz C class,67000,22000,6,0,0,1
10,Mercedez Benz C class,83000,20000,7,0,0,1
11,Mercedez Benz C class,79000,21000,7,0,0,1
12,Mercedez Benz C class,59000,33000,5,0,0,1

In [4]:
#drop 1 column from the n dummy columns to avoid dummy trap

In [5]:
final_df=dummy_df.drop(['Car Model','BMW X5'],axis=1)
final_df

    Mileage  Sell Price($)  Age(yrs)  Audi A5  Mercedez Benz C class
0     69000          18000         6        0                      0
1     35000          34000         3        0                      0
2     57000          26100         5        0                      0
3     22500          40000         2        0                      0
4     46000          31500         4        0                      0
5     59000          29400         5        1                      0
6     52000          32000         5        1                      0
7     72000          19300         6        1                      0
8     91000          12000         8        1                      0
9     67000          22000         6        0                      1
10    83000          20000         7        0                      1
11    79000          21000         7        0                      1
12    59000          33000         5        0                      1

In [6]:
from sklearn import linear_model

In [7]:
alg1=linear_model.LinearRegression()
alg1.fit(final_df.drop('Sell Price($)',axis=1).values,final_df['Sell Price($)'])

LinearRegression()

In [8]:
alg1.predict(final_df.drop('Sell Price($)',axis=1).values)

array([18705.27236456, 35286.78445595, 24479.1911246 , 41245.76426317,
       29882.98779028, 28023.61352427, 30614.46818485, 21879.57266985,
       12182.34562162, 26183.72387896, 18929.31674144, 20409.80511892,
       30477.15426153])

In [9]:
alg1.score(final_df.drop('Sell Price($)',axis=1).values,final_df['Sell Price($)'])

0.9417050937281082

In [10]:
alg1.predict([[45000,4,0,1]])

array([36991.31721031])

In [11]:
alg1.predict([[86000,7,0,0]])

array([11080.74313267])

### using sklearn's one-hot encoding

In [26]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [27]:
df_1=df.copy()
df_1['Car Model']=le.fit_transform(df_1['Car Model'])
df_1

    Car Model  Mileage  Sell Price($)  Age(yrs)
0           1    69000          18000         6
1           1    35000          34000         3
2           1    57000          26100         5
3           1    22500          40000         2
4           1    46000          31500         4
5           0    59000          29400         5
6           0    52000          32000         5
7           0    72000          19300         6
8           0    91000          12000         8
9           2    67000          22000         6
10          2    83000          20000         7
11          2    79000          21000         7
12          2    59000          33000         5

In [44]:
X=df_1.drop('Sell Price($)',axis=1).values
X

array([[    1, 69000,     6],
       [    1, 35000,     3],
       [    1, 57000,     5],
       [    1, 22500,     2],
       [    1, 46000,     4],
       [    0, 59000,     5],
       [    0, 52000,     5],
       [    0, 72000,     6],
       [    0, 91000,     8],
       [    2, 67000,     6],
       [    2, 83000,     7],
       [    2, 79000,     7],
       [    2, 59000,     5]], dtype=int64)

In [29]:
Y=df_1['Sell Price($)'].values
Y

array([18000, 34000, 26100, 40000, 31500, 29400, 32000, 19300, 12000,
       22000, 20000, 21000, 33000], dtype=int64)

In [45]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
ct=ColumnTransformer([('Car Model',OneHotEncoder(),[0])],remainder='passthrough')

In [46]:
X=ct.fit_transform(X)
X

array([[0.00e+00, 1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [47]:
include_list=[0,2,3,4]
X=X[:,include_list]
X

array([[0.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [0.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [0.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [1.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [48]:
alg2=linear_model.LinearRegression()
alg2.fit(X,Y)

LinearRegression()

In [53]:
alg2.score(X,Y)

0.9417050937281082

In [55]:
alg2.predict(X)

array([18705.27236442, 35286.78445647, 24479.1911247 , 41245.76426394,
       29882.98779058, 28023.61352428, 30614.468185  , 21879.57266962,
       12182.34562101, 26183.72387884, 18929.31674101, 20409.80511856,
       30477.15426156])

In [57]:
alg2.predict([[0,1,45000,4]])

array([36991.31721061])

In [59]:
alg2.predict([[0,0,86000,7]])

array([11080.74313221])